Revit 2027 API
TableSectionData.SetCellCombinedParameters(Int32, IList<TableCellCombinedParameterData>) Method
 Allows the caller to set combined parameter for a specified column
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData> paramData
)
Public Sub SetCellCombinedParameters (
	nCol As Integer,
	paramData As IList(Of TableCellCombinedParameterData)
)
public:
void SetCellCombinedParameters(
	int nCol,
	IList<TableCellCombinedParameterData^>^ paramData
)
member SetCellCombinedParameters :
        nCol : int *
        paramData : IList<TableCellCombinedParameterData> -> unit
Parameters
nCol Int32
paramData IList<TableCellCombinedParameterData>
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
SetCellCombinedParameters Overload
Autodesk.Revit.DB Namespace